/* No comment provided by engineer. */
"A new beta version of File Juicer is available" = "E' disponibile una nuova versione beta di File Juicer";

/* No comment provided by engineer. */
"A new version of File Juicer is available" = "E' disponibile una nuova versione di File Juicer";

/* No comment provided by engineer. */
"Cancel" = "Annulla";

/* As in choose folder */
"Choose" = "Scegli";

/* No comment provided by engineer. */
"Choose Folder" = "Scegli cartella";

/* No comment provided by engineer. */
"Could not save a found file. Check for disk space, and where the file is set to be saved in the preferences" = "Impossibile salvare un file trovato. Verifica lo spazio su disco, e dove deve essere salvato il file secondo le preferenze";

/* As in generating thumbnails */
"Generating:" = "Estrazione:";

/* No comment provided by engineer. */
"Go to Download Page" = "Vai alla pagina del Downlaod";

/* No comment provided by engineer. */
"Juicing:" = "Sto elaborando:";

/* When registration number check fails */
"License number is not valid!" = "Numero di licenza non valido!";

/* No comment provided by engineer. */
"No information about a new version is available!" = "Non sono disponibili informazioni riguardanti una nuova versione!";

/* No comment provided by engineer. */
"OK" = "OK";

/* skip generating thumbnails */
"Skip" = "Tralascia";

/* No comment provided by engineer. */
"Stop" = "Stop";

/* When registration succeeded */
"Thank You" = "Grazie";
"Thank You!\nPortable Version Registered" = "Grazie!\nVersione Portatile Registrata";

/* As in generating thumbnails */
"thumbnails" = "icone";

/* Of File Juicer */
"You have the newest version!" = "Hai la versione più recente!";

/* For File Juicer */
"Paid..." = "Pagato...";

/* For the image in the main window (I'll put it in a pdf later) */
"Drag files here" = "Trascina qui i files";

/* For flash card juicing */
"No Flash Cards/Disks Found!" = "Non trovo Flash Cards/Dischi!";

/* When registration code or name does not match */
"RegistrationFailed" = "I dati per la registrazione che sono stati inseriti non sono validi.  Verificate che il campo \"registrato a \" and \"codice registrazione\" siano inseriti esattamente come sono visualizzati nel codice di registrazione.";

/* The menu item */
"Registration..." = "Registrazione...";

"Watermark Reminder" = "File Juicer è Shareware.\nE' completamente funzionante, ma con i memo e le filigrane finchè non viene registrato.";

"FileJuicer is fully functional for %i days to let you try before you buy, but with watermarks in some images.\n" = "FileJuicer è completamente funzionante per %i giorni in modo da permetterti di provarlo prima di acquistarlo, ma con delle filigrane in alcune immagini.\n";
"The FileJuicer trial period has expired. JPEG and GIF will still get extracted but with watermarks in some images.\n" = "Il periodo di prova di FileJuicer è terminato. Le JPEG e le GIF continueranno ad essere estratte, ma con delle filigrane in alcune immagini.\n";
/* When registration code or name does not match */
"Your entry is too long." = "Nome troppo lungo.";

/* dropping files */
"File too large" = "File troppo grande";

/* If you want to convert WMV files you need a codec for QuickTime */
"If you want to convert WMV files you need a codec for QuickTime" = "Se vuoi convertire i files WMV hai bisogno di un codec per QuickTime";

/* If you want to convert WMV files you need a codec for QuickTime */
"Get Codec" = "Ottieni Codec";

/* For the File Menu */
"iPod Thumbs" = "iPod Thumbs";
"iPod Photo Cache" = "Cache foto iPod";
"JPEG Thumbs" = "anteprime JPEG";
"64 x 64 Thumbs" = "anteprime 64 x 64";
"32 x 32 Thumbs" = "anteprime 32 x 32";
"iPhone and iPod Touch Backups" = "iPhone and iPod Touch Backups";
"iTunes Album Artwork Cache" = "iTunes Album Artwork Cache";
/* Generating Index files */
"Index" = "Indice";